# Database setup - Project 2

In [2]:
# Imports
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine, MetaData
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric, Text, Float, ForeignKey
from sqlalchemy.orm import sessionmaker, relationship

In [3]:
# Create Engine
engine = create_engine("sqlite:///p2_cities.sqlite")

# Use `declarative_base` from SQLAlchemy to model the city table as an ORM class
# Make sure to specify types for each column
# Declare a Base object here
Base = declarative_base()

In [4]:
# Define the ORM class or `Cities`
### BEGIN SOLUTION
class Cities(Base):
    
    __tablename__ = 'cities'

    id = Column(Integer, primary_key=True)
    city = Column(Text)
    state_name = Column(Text)
    population = Column(Float)
    lat = Column(Float)
    lng = Column(Float)
    #date = Column(Text)
    #avg_edu = Column(Float)
    #avg_income_pc = Column(Float)
    #total_college_students = Column(Float)
    #crime_rate_per_100000 = Column(Float)
    
    def __repr__(self):
        return f"id={self.id}, name={self.name}"

In [5]:
#use create all to create the table 

Base.metadata.create_all(engine)

In [6]:
# Verify that the table name exists in the database
engine.table_names()

['cities']

In [7]:
# Use Pandas to Bulk insert each CSV file into the table
def populate_table(engine, table, csvfile):
    """Populates a table from a Pandas DataFrame."""
    # connect to the database
    conn = engine.connect()
    
    # Load the CSV file into a pandas dataframe 
    df_to_insert = pd.read_csv(csvfile)
    
    # Orient='records' creates a list of data to write
    # http://pandas-docs.github.io/pandas-docs-travis/io.html#orient-options
    #orient = to columns or records better for our needs?
    data = df_to_insert.to_dict(orient='records')

    # Optional: Delete all rows in the table 
    conn.execute(table.delete())#NEEDED OR NOT?

    # Insert the dataframe into the database in one bulk insert
    conn.execute(table.insert(), data)
    
# Call the function to insert the data for each table
populate_table(engine, Cities.__table__, 'cities.csv')

In [8]:
# Use a basic query to validate that the data was inserted correctly for table 'cities'

engine.execute("SELECT * FROM cities WHERE population > 100000 ORDER BY population DESC LIMIT 1").fetchall()

[(1840034016, 'New York', 'New York', 19354922.0, 40.6943, -73.9249)]

In [9]:
#This CSV is serving as our dummy DATA

In [10]:
df = pd.DataFrame(engine.execute("SELECT * FROM cities ORDER BY population DESC LIMIT 100").fetchall())

In [11]:
df.columns = ["id", "city_name", "state", "pop","lat", "lng"]

In [12]:
len(df["state"].unique())

38

In [14]:
engine = create_engine("sqlite:///cities_db.sqlite")

# Use `declarative_base` from SQLAlchemy to model the city table as an ORM class
# Make sure to specify types for each column
# Declare a Base object here
Base = declarative_base()

In [15]:
# Define the ORM class or `Cities`
### BEGIN SOLUTION
class Cities(Base):
    
    __tablename__ = 'cities'

    id = Column(Integer, primary_key=True)
    city = Column(Text)
    state_name = Column(Text)
    population = Column(Float)
    lat = Column(Float)
    lng = Column(Float)
    #date = Column(Text)
    #avg_edu = Column(Float)
    #avg_income_pc = Column(Float)
    #total_college_students = Column(Float)
    #crime_rate_per_100000 = Column(Float)
    
    def __repr__(self):
        return f"id={self.id}, name={self.name}"

In [16]:
Base.metadata.create_all(engine)

In [17]:
# Verify that the table name exists in the database
engine.table_names()

['cities']

In [18]:
# Use Pandas to Bulk insert each CSV file into the table
def populate_table(engine, table, csvfile):
    """Populates a table from a Pandas DataFrame."""
    # connect to the database
    conn = engine.connect()
    
    # Load the CSV file into a pandas dataframe 
    df_to_insert = pd.read_csv(csvfile)
    
    # Orient='records' creates a list of data to write
    # http://pandas-docs.github.io/pandas-docs-travis/io.html#orient-options
    #orient = to columns or records better for our needs?
    data = df_to_insert.to_dict(orient='records')

    # Optional: Delete all rows in the table 
    conn.execute(table.delete())#NEEDED OR NOT?

    # Insert the dataframe into the database in one bulk insert
    conn.execute(table.insert(), data)
    
# Call the function to insert the data for each table
populate_table(engine, Cities.__table__, 'main.csv')

In [20]:
df = pd.read_csv("main.csv")
df.head()

,Id2,Geography,Travel time to work (min),Median Income,Percent bachelor's degree or higher,Establishments 2011,Establishments 2016,Pop: 2011,Pop: 2016,% Change,LAT,LON,city,state
0,10180,"Abilene, TX",1313825,48016,20.4,3844.0,3950.0,165858.0,170860.0,-0.250727,32.448736,-99.733144,Abilene,TX
1,10420,"Akron, OH",7359250,51598,31.0,16402.0,16390.0,701456.0,702221.0,-0.182022,41.081445,-81.519005,Akron,OH
2,10500,"Albany, GA",1215320,40667,18.6,3242.0,3123.0,161617.0,152506.0,2.084330,31.578507,-84.155741,Albany,GA
3,10580,"Albany-Schenectady-Troy, NY",9953675,65855,37.4,21027.0,21444.0,871478.0,881839.0,0.784933,42.763648,-73.653621,Albany-Schenectady-Troy,NY
4,10740,"Albuquerque, NM",9286780,50954,31.8,18466.0,18645.0,899149.0,913924.0,-0.662977,35.084386,-106.650422,Albuquerque,NM